const ctx = document.getElementById('myChart').getContext('2d');
const myChart = new Chart(ctx, {
    type: 'line', // тип діаграми: 'line', 'bar', 'pie'
    data: {
        labels: ['Чт 3:00', 'Чт 9:00', 'Чт 15:00', 'Чт 21:00', 
            'Пт 3:00', 'Пт 9:00', 'Пт 15:00', 'Пт 21:00',
            'Сб 3:00', 'Сб 9:00', 'Сб 15:00', 'Сб 21:00',
            'Нд 3:00', 'Нд 9:00', 'Нд 15:00', 'Нд 21:00',
            'Пн 3:00', 'Пн 9:00', 'Пн 15:00', 'Пн 21:00', 
            'Вт 3:00', 'Вт 9:00', 'Вт 15:00', 'Вт 21:00', 
            'Ср 3:00', 'Ср 9:00', 'Ср 15:00', 'Ср 21:00', 
            ],
        datasets: [{
            label: 'Температура (°C)',
            data: [11, 15, 21, 13,
                11, 12, 17, 14,
                10, 13, 22, 14,
                11, 13, 23, 17,
                15, 14, 15, 10,
                7, 9, 11, 8,
                6, 9, 14, 11
            ],
            borderWidth: 1,
            backgroundColor: 'rgba(188, 119, 8, 0.6)'
        }]
    },
    options: {
        responsive: true,
        scales: {
            y: {
                beginAtZero: true
            }
        }
    }
});
